[
    {
        "Title": "Mr. Natwarlal",
        "Year": "2024",
        "IMDb Rating": "9.9",
        "Directors": [
            "V. Lava"
        ],
        "Cast": [
            "V. Lava"
        ],
        "Plot Summary": "A con artist in 1950s India uses clever schemes to steal from the rich, earning the nickname \"Mr. Natwarlal.\" Though impossible to catch, his risky lifestyle endangers his freedom."
    },
    {
        "Title": "Non Rowdy",
        "Year": "2023",
        "IMDb Rating": "9.9",
        "Directors": [
            "Prashantha K. Shetty"
        ],
        "Cast": [
            "Prashantha k. Shetty"
        ],
        "Plot Summary": "NON ROWDY, the movie chronicles the journey of the young boy who is trying to find a balance between the harsh society and yet want to achieve his dreams"
    },
    {
        "Title": "The Carpenter",
        "Year": "2023",
        "IMDb Rating": "9.8",
        "Directors": [
            "Garrett Batty"
        ],
        "Cast": [
            "Garrett Batty",
            "Kameron Krebs",
            "Kenny Krebs"
        ],
        "Plot Summary": "After the death of his father, a fighter becomes an apprentice to a mysterious Carpenter."
    },
    {
        "Title": "Hide and Seek",
        "Year": "2024",
        "IMDb Rating": "9.8",
        "Directors": [
            "Punith Nagaraju"
        ],
        "Cast": [
            "Punith Nagaraju"
        ],
        "Plot Summary": "A police officer is on a trail to hunt an elusive Ghost Leader indulged in trafficking.When an order for a wealthy businessman's daughters is given, the hero takes the job, but it leads to unexpected twists and turns."
    },
    {
        "Title": "Kanto Boy 2: Anak ni Totoy Guapo",
        "Year": "1994",
        "IMDb Rating": "9.8",
        "Directors": [
            "Augusto Salvador"
        ],
        "Cast": [
            "Humilde 'Meek' Roxas"
        ],
        "Plot Summary": ""
    },
    {
        "Title": "Buddhivantha 2",
        "Year": "2023",
        "IMDb Rating": "9.8",
        "Directors": [
            "Jaidhev"
        ],
        "Cast": [
            "Stars",
            "Adithya",
            "Srinagar Kitty",
            "Sonal Monteiro",
            ""
        ],
        "Plot Summary": ""
    },
    {
        "Title": "Golden Eagle. Special Forces (Aka Berkut)",
        "Year": "2023",
        "IMDb Rating": "9.8",
        "Directors": [
            "Daniyar Ibragimov"
        ],
        "Cast": [
            "Sanjar Madi",
            "Dauren Sergazin",
            "Asylkhan Tolypov"
        ],
        "Plot Summary": "A group of candidates undergoes trials to earn the maroon beret (special forces traditional hat). There are three friends among them who try to stick together - Ruslan, Kaysar, and Aibyn. Ruslan and Kaysar are taking the tough exam for the first time, while for Aibyn, it's his third attempt. Each of them dreams of joining the National Guard special unit, but only one ... Read all"
    },
    {
        "Title": "Nina",
        "Year": "2023",
        "IMDb Rating": "9.8",
        "Directors": [
            "Ahmed Ifnaz Firag",
            "Ilyas Waheed"
        ],
        "Cast": [
            "Ilyas Waheed"
        ],
        "Plot Summary": ""
    },
    {
        "Title": "Lai Jhakaas",
        "Year": "2023",
        "IMDb Rating": "9.8",
        "Directors": [
            "Babu Bhatt"
        ],
        "Cast": [
            "Stars",
            "Mukesh Bhatt",
            "Nagesh Bhosle",
            "Falguni",
            ""
        ],
        "Plot Summary": "Vishwasrao is a businessman from Maharashtra who has made a fortune by expanding his business overseas. Things change when his beloved daughter Priya comes to India to study and falls for Sangram."
    },
    {
        "Title": "One Way",
        "Year": "2023",
        "IMDb Rating": "9.8",
        "Directors": [
            "Sachin Kumar Funde"
        ],
        "Cast": [
            "Pravesh Singh"
        ],
        "Plot Summary": "The Story throw's light on Prarabdh Karma(The Arrow has left the bow) the evil deeds done two decades back is haunting Ranadheer and the love triangle of Pranit which can have Unfortunate consequences."
    },
    {
        "Title": "The Jadon264 Movie",
        "Year": "2023",
        "IMDb Rating": "9.8",
        "Directors": [
            "Jadon264"
        ],
        "Cast": [
            "Jadon264",
            "Amy Rose"
        ],
        "Plot Summary": "When an insane, greedy, violent puppet named Spamtom tries to steal Jadon's channel, Jadon and his friend must go on a time traveling adventure to stop him."
    },
    {
        "Title": "Fighting the Fire",
        "Year": "2024",
        "IMDb Rating": "9.7",
        "Directors": [
            "Bobby Lacer"
        ],
        "Cast": [
            "Bobby Lacer"
        ],
        "Plot Summary": "Brian Cook has been firefighter for over 15 years, but he is now facing the biggest battle of his life - not the fire in the field, but the fire burning inside."
    },
    {
        "Title": "Chasing Red",
        "Year": "2015",
        "IMDb Rating": "9.7",
        "Directors": [
            "Dennis Clancey"
        ],
        "Cast": [
            "Dennis Clancey"
        ],
        "Plot Summary": "Everyone has heard of Pamplona's Running of the Bulls, yet so few know much about it. Even fewer know that there is an elite group of runners who brave dozens of bull runs each year, risking their life to run inches away from the sharp horns of the 1000+ pound ferocious animals they revere. Chasing Red is a character-driven documentary following 4 runners across the e... Read all"
    },
    {
        "Title": "Spider Girl",
        "Year": "2023",
        "IMDb Rating": "9.7",
        "Directors": [
            "Manny Weathers"
        ],
        "Cast": [
            "Manny Weathers"
        ],
        "Plot Summary": "Fan film, limited to family only Disclaimer, not associated with Marvel or Sony"
    },
    {
        "Title": "Bond Ravi",
        "Year": "2022",
        "IMDb Rating": "9.7",
        "Directors": [
            "Prajwal SP"
        ],
        "Cast": [
            "Stars",
            "Vijay Chendoor",
            "Dharma",
            "Giri",
            ""
        ],
        "Plot Summary": "It's a social story, hero is living a life in prison, unexpectedly the hero becomes acquainted with the heroine, then hero gets realises what life means. after hero releasing from prison he is dreaming of a new life with a heroine."
    },
    {
        "Title": "The Knight Squad",
        "Year": "2014",
        "IMDb Rating": "9.7",
        "Directors": [
            "David Noble"
        ],
        "Cast": [
            "Stars",
            "Yong Ho Nam",
            "Johnny Vieira",
            "Brian Forbes",
            ""
        ],
        "Plot Summary": "The Russian and Korean mafias begin a bloody fued after a russian informant discovers a dark korean secret. Daniel and Robert become victims in this fued, causing them to take retribution by creating a vigilante group called The Knight Squad. Battles ensue as Demon Knight & Knightmaire attack both mobs, tug Deathstrike, assassin Preybird, and a host of others."
    },
    {
        "Title": "Bhalessa",
        "Year": "2023",
        "IMDb Rating": "9.7",
        "Directors": [
            "Balvinder Singh"
        ],
        "Cast": [
            "Balvinder Singh"
        ],
        "Plot Summary": ""
    },
    {
        "Title": "Thorn in the Center of the Heart (Sin Lai Guh Ling Bang Do)",
        "Year": "2021",
        "IMDb Rating": "9.7",
        "Directors": [
            "Thang Mung"
        ],
        "Cast": [
            "Writers",
            "Nuam Boih",
            "Marc Hemingway",
            "Anneli Mung",
            ""
        ],
        "Plot Summary": "Khan Pi is a father, retired from military special operations, and struggling to pay medical bills since the death of his wife. Offered a chance to get rich, Khan Pi has to decide whether to care for his family or maintain his integrity."
    },
    {
        "Title": "Agent Big Bones: Who Killed Jason Bones?",
        "Year": "2021",
        "IMDb Rating": "9.7",
        "Directors": [
            "Vikram Benipal"
        ],
        "Cast": [
            "Stars",
            "Vikram Benipal",
            "Harshal Brahmbhatt",
            "Jason Buyers",
            ""
        ],
        "Plot Summary": ""
    },
    {
        "Title": "Irattachankan",
        "Year": "2023",
        "IMDb Rating": "9.6",
        "Directors": [
            "Johny Asamsa"
        ],
        "Cast": [
            "Johny Asamsa"
        ],
        "Plot Summary": "In a murder-ridden city, an investigation led by DYSP points to Joji as the killer. Defense lawyer Advocate Boban shocks everyone in court with a mysterious motive and startling truth."
    },
    {
        "Title": "I Swear I Promise",
        "Year": "2022",
        "IMDb Rating": "9.6",
        "Directors": [
            "Christopher Fowler",
            "Christopher Tarantino"
        ],
        "Cast": [
            "Christopher Fowler",
            "Christopher Tarantino"
        ],
        "Plot Summary": "Cerious and Pressure are two brothers from Tifton, Georgia; both caught up in street life. Pressure takes a wrong turn and unknowingly gets himself and Cerious involved with crooked cops. Now Cerious must face off with his old friend Fly."
    },
    {
        "Title": "786",
        "Year": "2005",
        "IMDb Rating": "9.6",
        "Directors": [
            "K.S. Nageswara Rao"
        ],
        "Cast": [
            "K.S. Nageswara Rao"
        ],
        "Plot Summary": "A young medical student Rajesh (Sashikanth) is funded by farmers of his village and the other neighbouring villages. He falls in love with Alekya (Yana Sheik) daughter of a mafia king Anant Raj. He traps Rajesh in a twin murder case. How Rajesh proves his innocence will be the rest of the story."
    },
    {
        "Title": "Rupayi",
        "Year": "2023",
        "IMDb Rating": "9.6",
        "Directors": [
            "Vijay Jagadal"
        ],
        "Cast": [
            "Vijay Jagadal"
        ],
        "Plot Summary": "This movie Story rotates between relationships and neediness of money. In story line there are five major characters who fights between money and life. The script is filled with humorous comedy, love, Action and emotions which all type of audience can connect & relate themselves with each character."
    },
    {
        "Title": "The Big Game of Siena",
        "Year": "2022",
        "IMDb Rating": "9.6",
        "Directors": [
            "Stelios Laiopoulos"
        ],
        "Cast": [
            "Stelios Laiopoulos"
        ],
        "Plot Summary": "A student's quiet daily life is disrupted when old classmates, who have become involved with the underworld, force him to get involved in their dirty business. His life becomes a real hell but as time passes, things are not as they really seems."
    },
    {
        "Title": "Shambho Shiva Shankara",
        "Year": "2022",
        "IMDb Rating": "9.6",
        "Directors": [
            "Shankar Konamanahalli"
        ],
        "Cast": [
            "Shankar Konamanahalli"
        ],
        "Plot Summary": "Three boys, Shambhu Shiva Shankar, who have been sentenced as juvenile delinquents, come out of jail and live their lives by doing small jobs without knowing what to do next."
    },
    {
        "Title": "OF THE SEA: a film about California Fishermen",
        "Year": "2016",
        "IMDb Rating": "9.6",
        "Directors": [
            "Mischa Hedges"
        ],
        "Cast": [
            "",
            "See production info at IMDbPro"
        ],
        "Plot Summary": "Struggling to revive a fading way of life, fishermen and entrepreneurs are creating new models for how to support sustainably produced seafood. OF THE SEA tells the story of California fishing communities and presents a compelling story of the future of sustainable seafood."
    },
    {
        "Title": "The Return of Uncle Benon",
        "Year": "2011",
        "IMDb Rating": "9.5",
        "Directors": [
            "Nabwana I.G.G."
        ],
        "Cast": [
            "Nabwana I.G.G."
        ],
        "Plot Summary": "Gladwell becomes Madwell and has some badwell guys :)"
    },
    {
        "Title": "The Shoonyah: Chapter 1 - Blow of the War Horns",
        "Year": "2021",
        "IMDb Rating": "9.5",
        "Directors": [
            "Deepak S.V."
        ],
        "Cast": [
            "Deepak S.V."
        ],
        "Plot Summary": "This epic fantasy fiction portrays Indian martial art form Kalarippayattu at it's best. The magnificent journey of a martial art prodigy from a young aspiring boy to a legendary warrior, narrated in a stunningly redefining visual language, as never seen before."
    },
    {
        "Title": "Di bale na lang",
        "Year": "1987",
        "IMDb Rating": "9.5",
        "Directors": [
            "Mike Relon Makiling"
        ],
        "Cast": [
            "Writers",
            "Manuel 'Fyke' Cinco",
            "Jake Cocadiz",
            "Joey De Leon",
            ""
        ],
        "Plot Summary": "This is a musical romantic comedy inspired by Valenciano's hit song."
    },
    {
        "Title": "Memory Lane",
        "Year": "2022",
        "IMDb Rating": "9.5",
        "Directors": [
            "Ross Holman"
        ],
        "Cast": [
            "Ross Holman"
        ],
        "Plot Summary": "This time travel music adventure follows Arcadia Smith as he discovers he can relive the past and see into the future."
    },
    {
        "Title": "Prince of Eurasia",
        "Year": "2022",
        "IMDb Rating": "9.5",
        "Directors": [
            "I. Kolyada",
            "Prince Oak Oakleyski"
        ],
        "Cast": [
            "Wanwisa Jaidee",
            "I. Kolyada"
        ],
        "Plot Summary": "Rare historical biography of Prince Oak Oakleyski was encapsulated in this movie. Filming mainly in Uzbekistan, the original homeland of royal ancestry of Prince Oak Oakleyski. Some dust-up actions were brought into play for zest."
    },
    {
        "Title": "Raka",
        "Year": "2021",
        "IMDb Rating": "9.5",
        "Directors": [
            "Dhananjay Mukherjee"
        ],
        "Cast": [
            "Dhananjay Mukherjee"
        ],
        "Plot Summary": "Ramakant alias RAKA has built up his anti-social empire with the looted money from the poor people of West Bengal."
    },
    {
        "Title": "Késárí the King",
        "Year": "2023",
        "IMDb Rating": "9.4",
        "Directors": [
            "Tope Adebayo",
            "Ibrahim Yekini"
        ],
        "Cast": [
            "Stars",
            "Femi Adebayo",
            "Adebowale Adedayo",
            "Odunlade Adekola",
            ""
        ],
        "Plot Summary": ""
    },
    {
        "Title": "Asthra",
        "Year": "2023",
        "IMDb Rating": "9.4",
        "Directors": [
            "Azad Alavil"
        ],
        "Cast": [
            "Vinu K. Mohan",
            "Jiju Raj"
        ],
        "Plot Summary": "Asthra movie story revolves In Sulthan Bathery Wayanad district. as two Police officers are attacked and killed by a gang in the last 48 hours. They draw an arrow sign on the wall with blood. Investigation officer Joshy Mathew investigates the case in unusual and different methods to catch the gang."
    },
    {
        "Title": "Push Part 1",
        "Year": "2022",
        "IMDb Rating": "9.4",
        "Directors": [
            "Kevin Juniour Smith"
        ],
        "Cast": [
            "Justin Rochester"
        ],
        "Plot Summary": ""
    },
    {
        "Title": "Tough Guy",
        "Year": "2023",
        "IMDb Rating": "9.4",
        "Directors": [
            "George Moreno",
            "David Topf"
        ],
        "Cast": [
            "George Moreno",
            "David Topf"
        ],
        "Plot Summary": "Tony grew up idolizing two classic tough guys, the Middleweight Champion of the World, and his father, but when he finds himself down on his luck with a bad diagnosis and no money for medicine, he has to prove his own toughness in the brutal, criminal underworld of online streaming bare knuckle boxing."
    },
    {
        "Title": "Supplier Shankara",
        "Year": "2024",
        "IMDb Rating": "9.4",
        "Directors": [
            "Ranjith Singh Rajput"
        ],
        "Cast": [
            "Ranjith Singh Rajput"
        ],
        "Plot Summary": "Revolves around the life of a bar supplier Shankara, an unexpected murder in the bar changes the life of Shankara."
    },
    {
        "Title": "Black Widow: Forever Red",
        "Year": "2021",
        "IMDb Rating": "9.4",
        "Directors": [
            "Mario Durán Araujo"
        ],
        "Cast": [
            "Mario Durán Araujo"
        ],
        "Plot Summary": "Black Widow is now a wanted criminal; with the help of Jessica Jones and Daredevil, they have to stop Taskmaster, an enemy who changed her life forever."
    },
    {
        "Title": "The Big Gift",
        "Year": "2022",
        "IMDb Rating": "9.4",
        "Directors": [
            "Jarrod Crooks"
        ],
        "Cast": [
            "Erin Antilla",
            "Jarrod Crooks"
        ],
        "Plot Summary": ""
    },
    {
        "Title": "Rent a Room",
        "Year": "2023",
        "IMDb Rating": "9.4",
        "Directors": [
            "Jim Iyke"
        ],
        "Cast": [
            "Jim Iyke",
            "Bode Ojo"
        ],
        "Plot Summary": "Obi tries to balance making his wife, Labake, happy and paying bills by turning their house into a hotel called \"Obi's Palace\". Their marriage is tested when strange guests check in, putting them in funny and dangerous situations."
    },
    {
        "Title": "The Bond - A Jaron Ikner Film",
        "Year": "2022",
        "IMDb Rating": "9.4",
        "Directors": [
            "Jaron Ikner"
        ],
        "Cast": [
            "Jaron Ikner"
        ],
        "Plot Summary": "Two estranged brothers must fight their way through a pandemic stricken city in an attempt to save their mother and themselves."
    },
    {
        "Title": "Jatt Punjab Daa",
        "Year": "1992",
        "IMDb Rating": "9.4",
        "Directors": [
            "Yograj Singh"
        ],
        "Cast": [
            "Yograj Singh"
        ],
        "Plot Summary": "Balwant (Yograj Singh) is a young man who has ongoing disputes with one of his neighbors Jang Singh (Deep Dhillon). The court gives a decision in Balwant's favor. Jang Singh is furious. He kills Balwant's father and frames Balwant for it. After 7 years imprisonment, Balwant returns home to find out that Jang Singh has also killed his brother. He takes a revenge by kil... Read all"
    },
    {
        "Title": "The Wind That Blows",
        "Year": "2012",
        "IMDb Rating": "9.4",
        "Directors": [
            "Tom Weston"
        ],
        "Cast": [
            "Stars",
            "Eustace Kydd",
            "Athneal Ollivierre",
            "Nolly Simmons",
            ""
        ],
        "Plot Summary": "In the mid 19th century, Yankee whalers taught the sailors on the tiny island of Bequia in the West Indies how to catch whales. The once proud American tradition has been kept alive and cherished by Bequians generation after generation. For the last few decades outside pressures, overt and covert, have conspired against the whale hunters and those who rely on them. Th... Read all"
    },
    {
        "Title": "Maa Nanna Naxalite",
        "Year": "2022",
        "IMDb Rating": "9.4",
        "Directors": [
            "P. Sunil Kumar Reddy"
        ],
        "Cast": [
            "P. Sunil Kumar Reddy",
            "Gaman Sree",
            "Gaman Sree"
        ],
        "Plot Summary": "It is an emotional journey of an aging Naxalite leader Kondarudra Seetharamayya, who wants to meet his son in his last days . Police are in pursuit of him as he eliminated a political personality who is the father of Home minister."
    },
    {
        "Title": "A Filha Do Governador (2015/1)",
        "Year": "2015",
        "IMDb Rating": "9.4",
        "Directors": [
            "Edinei Nunes Nelma Leal Daiky Lorrane Manoel Assis"
        ],
        "Cast": [
            "Edinei Nunes",
            "Welle Felipe de Araujo"
        ],
        "Plot Summary": ""
    },
    {
        "Title": "The Key of Baku",
        "Year": "2022",
        "IMDb Rating": "9.4",
        "Directors": [
            "Zaur Tahirsoy"
        ],
        "Cast": [
            "Zaur Tahirsoy"
        ],
        "Plot Summary": ""
    },
    {
        "Title": "Chi Town Thunderfist",
        "Year": "2023",
        "IMDb Rating": "9.4",
        "Directors": [
            "John C. Boyer"
        ],
        "Cast": [
            "John C. Boyer"
        ],
        "Plot Summary": "Mob boss Biggsy Giancarlo thought he ran Chicago. But Chicago is Slick Willy's town. After Biggsy had Willy's friend killed, Willy uses his Kung Fu skills to go on a revenge tour, hoping to take down the boss's entire organization."
    },
    {
        "Title": "Westenbrink",
        "Year": "2008",
        "IMDb Rating": "9.4",
        "Directors": [
            "Pim Razenberg"
        ],
        "Cast": [
            "Pim Razenberg"
        ],
        "Plot Summary": "When Manons father dies, her best friend Paul helps her in the search for her long lost mother. Meanwhile, her boyfriend Joshua fails to find a way to deal with Manons depressing situation."
    },
    {
        "Title": "The Gods 2: The Dark Side",
        "Year": "2023",
        "IMDb Rating": "9.3",
        "Directors": [
            "Mykel Shannon Jenkins"
        ],
        "Cast": [
            "Mykel Shannon Jenkins"
        ],
        "Plot Summary": "Following 'The Gods', Mikey James comes back from hiding to pay old debts, only to be fighting for survival against his old enemy Anthony Fasano, awaiting his return."
    }
]